[
  {
    "daily_clients": "C'est une table journaliere qui sert à récupèrer tout les informations sur le client. Elle contient des informations détaillées sur les clients. La colonne MSISDN qui représente l’identifiant unique du client tandis que FORMULE indique le type d’offre souscrite (Jamono Allo, Kirene avec Orange, etc). FAMILLE_PROD précise la catégorie du produit (PREPAID, POSTPAID, etc.) et ETAT_LIGNE renseigne l’état actuel de la ligne du client (ACTIVE, RESILIEE, etc.). Les colonnes date_premiere_activation et date_resiliation suivent respectivement la date d’activation initiale et la date de résiliation si elle existe. BOX identifie si la ligne est associée à un boîtier spécifique. formule_dmgp, region_90j, departement_90j, commune_arrondissement_90j, ca_cr_commune_90j, region_30j, departement_30j, commune_arrondissement_30j, ca_cr_commune_30j fournissent des informations commerciales et géographiques des clients au cours des 90 et 30 derniers jours. De meme que zone_drv_90j, zone_dvri_90j, nom_cellule_90j, zone_drv_30j, zone_dvri_30j et nom_cellule_30j donnent des détails sur la zone réseau et la cellule utilisée pour les 90 et 30 derniers jours. statut_predit correspond à une prédiction de statut client (par exemple risque de churn) tandis que age et sex décrivent le profil démographique de l’utilisateur. SEGMENT_RECHARGE et SEGMENT_MARCHE classifient le client selon son comportement de consommation et son marché cible. last_imei identifie le dernier appareil utilisé, smartphone précise s’il s’agit d’un smartphone et compatible_network indique la technologie réseau supportée (2G, 3G, 4G, 5G). more_used_imei peut référencer l’appareil le plus utilisé. type_offre correspond à l'offre utilisé par le client, num_ligne, ndos et ncli contiennent des informations internes liées à la gestion des lignes. DIGITAL_USER est un indicateur d’utilisation des services digitaux. Enfin, year, month, et day permettent d’historiser et de suivre l’évolution des données dans le temps. La table est mise à jour quotidiennement. Elle est important pour l’analyse du comportement client, la gestion du parc, la segmentation marketing, etc.",
    "daily_clients_digitaux": "C'est une table journaliére qui liste l'ensemble des clients qui apparaissent dans les différentes plateformes digitale de Sonatel ou Orange. Elle contient les informations digitales détaillées des abonnés et leur activité sur le réseau. Chaque ligne représente un abonné identifié par son msisdn. On y retrouve plusieurs catégories d’informations : le segment de recharge (S0,Mass-Market, Middle, High, Super High), la formule d’abonnement et sa déclinaison dans le champ formule_dmgp ainsi que l’opérateur (orange ou concurrent). Il inclut également des données sur l’état d’inscription (inscrit ou pas) aux services Orange Money (inscrit_maxit, inscrit_appli_om, inscrit_om) avec les dates d’inscription correspondantes ainsi que les dates et durées d’inactivité. D’autres colonnes indiquent l’activité récente des clients, comme parc_actif_orange, actif_maxit_jour, actif_appli_om_jour et parc_actif_om_30_jours ou encore la présence d’un smartphone et l’usage d’USSD. Le tableau renseigne aussi la localisation géographique de l’abonné à travers la commune, le département, la région, la zone de distribution (zone_drv et zone_dvri). Enfin, les colonnes year, month et day permettent de situer les données dans le temps facilitant ainsi le suivi de l’évolution et l’analyse de la base client sur les plateformes digitales. Cette table permet de suivre et d'analyser le parc actif orange des plateformes digitales, les inscriptions des clients sur les plateformes digitaux (OM, Maxit, etc) par segment, par formule, etc.",
    "daily_conso": "C'est une table journalière qui donne le montant des consommations du client faites sur les appels internationaux .La table présente les informations relatives à la consommation voix internationale des abonnés. Chaque ligne est identifiée par un msisdn qui représente le numéro unique de l’abonné. La colonne ticket_type indique le type de service. La colonne ca_voix_international fournit le montant des consommations des appels internationaux pour chaque abonné. Les colonnes year, month et day permettent de situer ces données dans le temps, facilitant l’analyse de la consommation par période. Elle est utile pour suivre l’évolution du trafic voix international et identifier les abonnés les plus actifs ou les périodes de forte utilisation",
    "daily_data": "C'est une table Journaliere qui donne la consommation Data mobile des clients. Elle donne aussi le volume du trafic des clients par réseau 2G, 3G, 4G, 5G. Elle contient des informations sur le trafic data mobile des abonnés. Chaque client est identifié par un msisdn et qui représente l’identifiant unique de l’abonné. Les colonnes trafic_2g_mo, trafic_3g_mo, trafic_4g_mo et trafic_5g_mo indiquent respectivement le volume de données consommées (en Mo) sur chaque type de réseau mobile (2G, 3G, 4G et 5G). La colonne total_volume_mo représente la somme totale du volume de données (volume de data) consommées par le clients tandis que trafic_data_roaming précise la part du trafic effectuée en itinérance (roaming). Les colonnes year, month et day permettent de situer ces consommations dans le temps pour effectuer des analyses périodiques. Elle est utile pour suivre la répartition de l’usage data mobile par technologie réseau et identifier les tendances de consommation.",
    "daily_delta_parc": "C'est une table Journaliere qui fournit les informations liées aux mouvements des clients. Elle présente des informations sur l’évolution du parc d’abonnés et leurs mouvements au fil du temps. Chaque ligne est identifiée par un MSISDN qui représente l’identifiant unique d’un abonné. La colonne parc_j indique si l’abonné est actif le jour analysé tandis que parc_j_moins_1 montre son statut la veille, ce qui permet de suivre les entrées et sorties du parc. La colonne NA représente les nouvelles arrivées abonnées. Les colonnes reactives, sortants_acquisition, sortants_gratuite et sortants_usage détaillent respectivement le nombre de réactivations, de désactivations liées à l’acquisition, l’offres gratuites ou à l’usage. Enfin, les colonnes year, month et day permettent de situer ces mouvements dans le temps pour un suivi quotidien et des analyses d’évolution.",
    "daily_habit_5g_user": "C'est une table journalière qui donne les informations relatives à la consommation Data mobile des Clients sur le réseau 5G par type d'application. Autrement dit, elle présente des données sur la consommation Internet par type d’application. La colonne application indique la catégorie d’usage, comme les jeux (volume_appli_games), la messagerie instantanée (volume_appli_chat), la navigation web (volume_appli_web), la voix sur IP (volume_appli_voip), la télévision mobile (volume_appli_mobiletv), les flux techniques (icmp_dns), etc. La colonne volume_go mesure la quantité de données consommées en gigaoctets pour chaque application. La colonne date_chargement enregistre le moment exact de consommation tandis que year, month et day permettent d’identifier la période précise facilitant ainsi l’analyse temporelle et le suivi des tendances de consommation Internet par type d’usage.",
    "daily_heavy_user_4g": "c'est une table journalière qui donne les informations sur les Heavy user c’est-à-dire qu'elle présente des données sur le suivi de la consommation 4G avec un focus sur les heavy users (gros consommateurs). La colonne parc représente le nombre total d’utilisateurs 4G dans la période donnée. percent_threshold indique le pourcentage servant de seuil pour identifier les heavy users, ici fixé à 0,7. trafic_threshold correspond au volume minimal de trafic (en octets) à partir duquel un utilisateur est considéré comme heavy user. Les colonnes total_trafic_heavy_user_4G et total_trafic_all_user_4G indiquent respectivement le volume total consommé par les heavy users et par l’ensemble des utilisateurs 4G. Enfin, year, month et day permettent de situer les données dans le temps, afin d’analyser l’évolution de la consommation des heavy users et d’identifier les périodes de forte utilisation.",
    "daily_infos_bts": "Cette table est une table journalière qui fournit les informations détaillées sur les sites physiques et les cellules radio. elle contient des informations détaillées sur les sites cellulaires et leurs caractéristiques techniques et géographiques. Chaque ligne correspond à un site ou une cellule mobile identifiée par des colonnes telles que NOM_SITE, NOM_CELLULE, LACID, CELLID, ID_CELLULE et SITEID. Les colonnes FREQUENCE et TYPOLOGIE_SITE indiquent les bandes de fréquences utilisées et le type de réseau disponible (2G, 3G, 4G, ou combinaison) tandis que PLAQUE, LONGITUDE, LATITUDE, X, Y, et Azimuth donnent les coordonnées géographiques et l’orientation de l’antenne. Les informations sur le TYPE_CELLULE, la REGION, le DEPARTEMENT, les zones administratives et locales (Cav_new, ca_cr_commune, ca_cr_commune_1, Milieu) permettent de situer le site dans son contexte territorial et urbain ou rural. D’autres colonnes comme zone_DRV, zone_DVRI, Zone_DRVNew, Zone_DVRINEW, Zone_SADI, zone_dvri_2025 et CONSTRUCTEUR apportent des détails sur les zones d’exploitation et le constructeur de l’infrastructure. Enfin, les colonnes year, month, day et date_chargement indiquent la date d’enregistrement ou de mise à jour des données. On peut dire que la table est donc un registre complet combinant aspects techniques, géographiques et administratifs des sites cellulaires pour une période donnée.",
    "daily_infos_otarie": "C'est une table journalière qui fournit la vision analytique de la consommation data mobile par type de terminal, marque, technologie d'accès (2G à 5G), etc. Elle présente des données détaillées sur l’usage et les caractéristiques des terminaux mobiles et tablettes connectés au réseau. Chaque ligne correspond à un type et model de l’appareil identifié par des colonnes tels que 'device_type', 'device_brand' et 'device_model' ainsi que par son 'APN' de connexion. Les colonnes REGION, DEPARTEMENT, commune_arrondissement, ca_cr_commune, et zone_DRV situent l’appareil dans un contexte géographique et administratif. Les colonnes parc_global et parc_5g indiquent respectivement le nombre total d’appareils et ceux compatibles avec le 5G tandis que total_volume_mo, volume_5g_mo, volume_4g_mo, volume_3g_mo, volume_2g_mo et volume_outbound_roaming_mo détaillent les volumes total de données consommés et le volume de données consommés selon la technologie réseau utilisée. Enfin, les colonnes date_chargement, year, month, et day renseignent la date d’enregistrement ou de mise à jour des données. Cette table combine donc des informations techniques, géographiques et de consommation pour analyser l’usage des différents appareils sur le réseau mobile. Elle est utilisée pour analyser le parc d'appareils mobiles et les volumes de données consommées, etc.",
    "daily_localisation_5g": "C'est une table journalière qui fournit la localisation des clients qui se connectent sur la 5G. Elle contient des informations relatives aux abonnés mobiles et à leur segmentation sur le marché. Chaque ligne représente un abonné identifié par msisdn, associé à un site mobile (nom_site) et à une localisation géographique précise via les colonnes REGION, DEPARTEMENT et zone_DRV. Les colonnes SEGMENT_RECHARGE et SEGMENT_MARCHE caractérisent le profil commercial et économique de l’abonné indiquant par exemple s’il appartient à un segment haut de gamme, moyen ou de masse ainsi que le type de clientèle ciblée (jeunes, autres, haut de marché, etc.). Enfin, les colonnes date_chargement, year, month, et day renseignent la date d’enregistrement ou de mise à jour de chaque entrée d'un client. Cette table permet donc d’analyser la distribution géographique et commerciale des abonnés mobiles et de segmenter le marché en fonction de différents profils de consommation.",
    "daily_maxit": "C'est une table journalière qui donne les clients qui se sont connectés sur l'application mobile MAXIT. Elle regroupe des informations détaillées sur les transactions et services effectués par les abonnés mobiles MAXIT. Chaque ligne correspond à un msisdn (identifiant de l'abonné) et décrit le type de service utilisé (par exemple, GET_BALANCES, TOPUP, CREDIT_BALANCE, TRANSFERT_MONEY, TRANSACTION_HISTORY,BUY_ILLIMIX, BUY_DATA, BUY_MIXEL, BUY_ILLIFLEX, SENELEC, etc) ainsi que le status de la transaction (SUCCEED, FAILED, PENDING). La colonne extra_source précise la source additionnelle de la transaction lorsqu’elle existe et amount indique le montant associé à l’opération. La colonne nb_events renseigne le nombre d’événements ou d’occurrences de ce service pour l’abonné. Les colonnes date_inscription, year, month, et day permettent de situer temporellement chaque transaction. Cette table fournit donc un aperçu complet des activités et interactions des abonnés avec les services mobiles Maxit, incluant les montants, la fréquence et les dates d’exécution.",
    "daily_oss_5g": "C'est une table journalière qui fournit des informations sur les cellules radio pour le réseau 5G. Elle contient des données de trafic et de performance pour différentes cellules radio du réseau. Chaque ligne correspond à une cellule avec son nom (cell_name) et inclut le trafic montant (trafic_ul_GB) et descendant (trafic_dl_GB) en gigaoctets ainsi que des indicateurs de performance tels que le throughput moyen par utilisateur en téléchargement (avg_user_thrput_dl) et le temps moyen d’attente pour le téléchargement (avg_user_qeued_dl). Les colonnes charge_prb_dl et charge_prb_ul représentent la charge en ressources radio sur les canaux descendant et montant. La colonne source indique le constructeur ou fournisseur de la cellule. Les colonnes week, date_chargement, year, month, et day renseignent respectivement la semaine de mesure et la date d’enregistrement des données. Cette table permet donc de suivre la consommation, la performance et la charge des cellules réseau sur une période donnée, utile pour l’optimisation et la gestion du réseau mobile. Elle est conçue pour des analyses orientées réseau (5G) sur les cellules, Qualité de Service (QoS), retour utilisateur (QoE), etc. Voici quelques exemples de question : Lister les cellules ayant un débit moyen utilisateur inférieur à 1 Mbps sur le mois de mai 2025. Identifier les cellules saturées (charge_prb_dl > 80%) dans la semaine 202420. Comparer les performances des cellules selon leur constructeur (source). Repérer les zones où le trafic upload est supérieur à 5 Go en moyenne par jour.",
    "daily_parc": "C'est une table journalière qui fournit les informations sur les clients ou parc clients qui appartiennent au parc actif Orange. Elle présentent des informations détaillées sur l’activité des abonnés (Parc actif). Chaque ligne correspond à un msisdn (identifiant de l'abonné) et inclut le nombre d’appels entrants (entrant_cnt) et sortants (sortant_cnt) ainsi qu’un indicateur de régularité (regularite) et la date de dernière activité (last_active_date). Les colonnes d_prem_activ et status renseignent respectivement la date de première activation et le statut de la ligne (A, G, E, D, etc .). Les colonnes famprod, id_etat_ligne, d_resiliation et parc apportent des informations supplémentaires sur la famille de produits (prépayée, postpayée, etc) l’état de la ligne, la date de résiliation éventuelle et le parc associé (0/1). Enfin, les colonnes year, month, et day indiquent la date d’enregistrement des données. Elle est utile pour mesurer d'engagement utilisateur (via interactions entrantes/sortantes, régularité) et pour analyser le comportement, les churn (via d_resiliation, statut, ancienneté), l’usage des abonnés sur le réseau, etc. Elle donne  aussi l'indice de régularité d'activité du client (regularite).",
    "daily_parc_data": "C'est une table journalière qui fournit les informations sur les clients ou le parc client sur la consommation de donnée mobile ou data (Pass Internet). Elle enregistre des indicateurs d'activité data mobile pour chaque abonné, avec un suivi de fréquence d’usage, de dernière activité et une temporalité précise. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre de jours distincts d’activité (nb_j_distinct). Les colonnes year, month et day précisent la période d'utilisation des données mobiles.  Elle permet d’identifier les clients actifs data, inactifs data ou en déclin d’usage data, de segmenter les clients selon l’intensité d’usage data (actifs réguliers, occasionnels, inactifs) et peut être utilisée dans le cadre d’analyses de churn sur les données mobile, etc.",
    "daily_parc_data_4g": "C'est une table journalière qui fournit les informations sur les clients ou le parc clients qui ont eu à trafiquer sur le réseau 4G. Elle enregistre l’activité 4G des abonnés avec des informations sur la fréquence, la récence et la périodicité de l’utilisation. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre de jours distincts d’activité (nb_j_distinct). Les colonnes year, month et day précisent la période d'utilisation. Elle permet d’identifier les clients actifs sur le réseau 4G (ou le parc actif 4G) ou inactifs ou en déclin d’usage, d'analyser les comportements d’adoption ou de désengagement 4G dans le temps.",
    "daily_parc_illiflex": "C'est une table journalière qui fournit les informations sur les clients ou parc clients qui ont eu à acheter ou souscrire à un ILLIFLEX. Elle contient les données d’usage des offres illiflex pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité de l’utilisation de l'offre. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre de jours distincts d’activité (nb_j_distinct). Les colonnes year, month et day précisent la période d'utilisation. Elle permet d’identifier les clients actifs sur les offres ILLIFEX ou inactifs ou en déclin d’usage, de segmenter les utilisateurs illiflex selon la fréquence d’usage (nb_j_distinct) et la récence (last_active_date). Elle est conçue pour analyser l’engagement des clients sur les offres ILLIFLEX et identifier les profils à stimuler via des campagnes de relance ou des offres ciblées.",
    "daily_parc_illimix": "C'est une table journalière qui fournit les informations sur les clients ou parc clients qui ont eu à acheter ou souscrire à un ILLIMIX. Elle contient les données d’usage des offres illimix pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité de l’utilisation de l'offre. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre de jours distincts d’activité (nb_j_distinct). Les colonnes year, month et day précisent la période d'utilisation. Elle permet d’identifier les clients actifs sur les offres ILLIMIX ou inactifs ou en déclin d’usage, de segmenter les utilisateurs ILLIMIX selon la fréquence d’usage (nb_j_distinct) et la récence (last_active_date). Elle est conçue pour analyser l’engagement des clients sur les offres ILLIMIX et identifier les profils à stimuler via des campagnes de relance ou des offres ciblées.",
    "daily_parc_maxit": "C'est une table journalière qui fournit les informations sur les clients ou le parc clients qui ont eu à faire une activité sur l'application mobile MAXIT. Elle contient les données d’usage de l'application MAXIT pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité de l’utilisation. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre de jours distincts d’activité (nb_j_distinct). Les colonnes year, month et day précisent la période d'utilisation de l'application. Elle permet d’identifier les clients actifs ou inactifs de l'application mobile MAXIT ou en déclin d’usage, de segmenter les utilisateurs MAXIT selon la fréquence d’usage (nb_j_distinct) et la récence (last_active_date). Elle est conçue pour analyser l’engagement des clients sur l'application mobile MAXIT.",
    "daily_parc_maxit_new": "C'est une table journalière qui fournit les informations sur les clients ou le parc clients qui ont eu à faire une activité sur l'application mobile MAXIT. Elle complète les autres tables centrées sur l’application MAXIT avec un focus sur le parc utilisateur global et l’engagement digital cumulé. Elle fournit aussi une une vision consolidée du parc utilisateur de l’application MAXIT en mesurant la dernière activité détectée et le nombre total de jours actifs. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la date de dernière activité (last_active_date) ainsi que le nombre total de jours d’activité (nbr_active). Les colonnes year, month et day précisent la période d'utilisation de l'application. Elle permet d’identifier les clients actifs ou inactifs de l'application mobile MAXIT ou en déclin d’usage",
    "daily_parc_pass": "C'est une table journalière qui fournit les informations sur les clients ou le parc client qui ont eu à souscrire ou à acheter des Pass Internet. Elle est essentielle pour le suivi des souscriptions aux Pass data ou internet. Elle contient les données de souscrition aux offres PASS INTERNET pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité de souscription. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la dernière date de souscription (last_active_date) ainsi que la fréquence d’achat (nb_j_distinct). Les colonnes year, month et day précisent la période de souscription. Elle permet d’identifier les clients actifs sur les offres PASS INTERNET ou inactifs ou en déclin d’usage, de segmenter les utilisateurs des PASS INTERNET selon la fréquence (nb_j_distinct) et la récence (last_active_date). Elle est conçue pour analyser l’engagement des clients sur les offres PASS INTERNET et identifier les profils à stimuler via des campagnes de relance ou des offres ciblées.",
    "daily_parc_recharges": "C'est une table journalière qui fournit les informations sur les clients ou parc clients qui ont eu à recharger. Elle couvre les comportements de recharge des abonnés, une dimension clé pour la fidélisation, le suivi de l’engagement et la détection de churn. Elle contient les données de recharges pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité de souscription. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la dernière date de recharge (last_active_date) ainsi que la fréquence de recharge (nb_j_distinct). Les colonnes year, month et day précisent la période de recharges. Elle permet d’identifier les clients actifs sur les recharges ou inactifs, de segmenter les utilisateurs qui font des recharges selon la fréquence (nb_j_distinct) et la récence (last_active_date). Elle est conçue pour analyser l’engagement des clients sur les recharges.",
    "daily_parc_sargal": "C'est une table journalière qui fournit les informations sur les clients ou parc clients qui ont échangé des points ou partcipé au programme Sargal. Elle permet de mesurer le niveau d’implication, la récence d’interaction avec le programme et la fidélité comportementale. Elle contient des données du programma de fidélité Sargal pour chaque abonné avec des informations sur la fréquence, la récence et la périodicité d'échange de points. Chaque ligne correspond à un MSISDN (identifiant unique d’un abonné) et inclut la dernière date d'échange (last_active_date) ainsi que la fréquence d'échange (nb_j_distinct). Les colonnes year, month et day précisent la période de recharges. Elle permet d’identifier les clients actifs sur le programme Sargal ou inactifs, de segmenter les utilisateurs Sargal selon la fréquence (nb_j_distinct) et la récence (last_active_date). Elle peut être utilisée pour des actions ciblées sur les clients et permet d'analyser l’engagement des clients sur les recharges.",
    "daily_recharges": "C'est une table journalière qui fournit le chiffre d’affaires généré total ainsi que des différents canaux de recharges. Elle présente des informations sur le revenu des recharges effectuées par les abonnés. Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et détaille les montants de recharge par type : ca_seddo pour les recharges via Seddo, ca_pass_glob_om_jour pour les pass globaux journaliers, ca_credit_om pour les crédits Orange Money, ca_iah, ca_cartes, et ca_wave pour d’autres canaux comme les cartes, Wave. La colonne ca_recharge représente le chiffre d'affaire total rechargé tandis que self_top_up indique les recharges effectuées par l’abonné lui-même. Enfin, les colonnes year, month et day précisent la date d’enregistrement des recharges. Elle peut être utilisée pour analyser les canaux de recharge dominants, segmenter les clients selon leur canal de recharge préféré, suivre le niveau de digitalisation du client, etc.",
    "daily_roaming": "C'est une table journalière qui est axée sur l’analyse des usages en roaming (itinérance internationale). Elle regroupe les données liées à l’utilisation des services mobiles en roaming (voix, data, SMS), ventilées par type de service et compteur d’usage (bonus, principal, pass, etc.). Elle présente des informations sur l’utilisation des services voix, SMS et data par les abonnés. Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et indique le type de ticket (ticket_type) qui peut être soit de la Voix, soit de la DATA ou SMS. Les colonnes cb_gratuit_dur, cp_gratuit_dur, et cy_gratuit_dur représentent les durées gratuites consommées, tandis que ci_pass_dur et cy_pass_dur concernent les durées issues de pass achetés. La colonne cp_dur indique la durée totale des communications payantes, et cb_dur celle des communications bonus. Enfin, les colonnes year, month, et day précisent la date d’enregistrement ou de mesure des données. Elle permet d’analyser les comportements des clients en itinérance, de mesurer l'adoption des offres roaming, segmenter les clients en voyageurs fréquents, occasionnels ou dormants, Évaluer l’impact de campagnes de bonus ou de pass roaming, etc.",
    "daily_sargal": "C'est une table journalière qui donne les informations sur les échanges et récompenses dans le programme de fidélité Sargal. Elle permet une analyse fine du comportement de fidélité, des préférences cadeaux et du potentiel de conversion client. Elle trace les interactions des abonnés avec le programme de fidélité Sargal en enregistrant les points gagnés, points cumulés et les récompenses obtenues. Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et renseigne le nombre de points gagné au cours d’une période donnée (points) ainsi que le total des points disponibles ou cumulé (nbpoints). La colonne cadeau_sargal indique le type de cadeau ou récompense associé tandis que cout_cadeau représente le coût de ce cadeau. Les colonnes year, month et day précisent la date d’enregistrement des points gagnés. Elle est utile pour suivre la fidélisation des clients, leur niveau de points et les récompenses obtenues.",
    "daily_souscription": "C'est une table journalière qui fournit des informations sur la souscription des offres. Elle contient les informations sur les offres souscrites par les abonnés. Elle comprend l’identifiant unique de l’abonné (msisdn), le nom de l’offre souscrite (offer_name) et sa catégorie (types) comme PASS INTERNET, ILLIMIX, ILLIFLEX, MIXEL, NC, BUNDLES, etc. Les colonnes sous_mnt, ca_data et ca_voix indiquent respectivement le montant des souscriptions (ca_data et ca_voix), la part attribuée à la data (internet) et celle liée à la voix (appels). La colonne sous_cnt précise le nombre de souscriptions enregistrées pour l’offre. Enfin les champs year, month et day représentent la date de la souscription permettant d’analyser l’évolution des offres et des revenus dans le temps. Elle permet de suivre les offres les plus rentables par catégorie, identifier les comportements d’achat récurrents ou impulsifs, segmenter les clients par typologie d’offre souscrite (voix-only, data-only, mixte), etc. Exemple de question : Donnez le CA ILLIFLEX ? Quelle est le CA des offres BUNDLES? Quelle est le CA MIXEL MOIS 1690F ?, Donne moi le CA ILLIMIX JOUR 500F ?, etc. Cette table permet de déterminer le chiffre d'affaire ou revenus généré par types d'offres, par offres, par période, etc.",
    "daily_suivi_offres_abonnes": "C'est une table journalière qui fournit des insights sur les offres en croissance, celles en déclin ou abandonnées et sert de base à des analyses de portefeuille produit, à des décisions de repositionnement tarifaire ou à des plans de fidélisation. Elle contient des informations sur l’état et l’évolution des offres. Elle inclut le nom de l’offre (offer_name) ainsi que sa catégorie (types), comme PASS INTERNET, ILLIMIX, ILLIFLEX, MIXEL, NC,Bundles etc. Les colonnes parc, na et resilies indiquent respectivement le nombre d’abonnés actifs sur l’offre, le nombre de nouveaux abonnés et le nombre de résiliations. La colonne date_chargement correspond à la date et l’heure du chargement de l'offre. Enfin les champs year, month et day représentent la période de référence, ce qui permet de suivre l’évolution des abonnements et des résiliations au fil du temps. Elle permet d'évaluer le cycle de vie des offres, la fidélité des abonnés à une gamme donnée, etc.",
    "daily_sva": "C'est une table journalière qui donne l'ensemble des clients qui ont eu à utiliser les services à valeur ajouté (sva). Elle contient des informations sur les services à valeur ajouté (sva). Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et renseigne le montant dépensé pour la souscription ou l’utilisation d’un service (sous_mnt). La colonne service indique la catégorie générale du service tandis que detail_service apporte une description plus précise comme CRBT subscription, SOS Crédit, DIGITALVIRGO_HYB, ARPUPLUS_HYB, etc. Enfin, les colonnes year, month, et day représentent la date de l’opération.",
    "daily_trafic_par_compteur": "C'est une table journalière qui donne la valeur du trafic des abonnés sur chaque compteur( Argent, Durée, Yeukle, Data, etc) . Elle recense les données de trafic des abonnés pour chaque compteur. Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) associé à un compteur qui représente une catégorie ou un identifiant de suivi spécifique. La colonne tickettype indique le type de ticket ou d’événement lié au trafic tandis que la colonne trafic mesure le volume ou la quantité de trafic généré. Les colonnes year, month, et day permettent de situer chaque enregistrement dans le temps. La table permet d'obtenir le Parc Client ayant trafiqué sur un compteur donné.",
    "daily_voix": "C'est une table journalière qui suit la consommation voix des abonnés  en distinguant les destinations des appels (opérateurs) la source de la minute consommée (compteur principal, bonus, pass spécifiques). Autrement dit, elle contient des données du volume ou durée des appels sortants des abonnées sur les différents opérateurs téléphoniques (Orange, Free, Expresso, ProMobile, etc). Chaque ligne correspond à un msisdn (identifiant unique d’un client) et détaille la consommation de voix sur plusieurs opérateurs mobiles avec les colonnes : CSU_Mobile, DIV, Expresso_Mobile, Fixe_Expresso, Fixe_Sonatel, Free, Orange, ProMobile et international. Les colonnes cb_gratuit_dur, cp_gratuit_dur, cy_gratuit_dur, ci_pass_dur, cy_pass_dur, cp_dur et cb_dur représentent différentes durées ou volumes appels liés à des offres ou pass qu’ils soient gratuits ou payants. Enfin, les colonnes year, month et day permettent de situer chaque enregistrement. Cette table  permet de suivre quotidiennement et d’analyser la durée des appels téléphoniques (voix) sur les différents opérateurs mobiles.",
    "daily_voix_view": "C'est une table journalière qui donne la consommation voix des abonnées en OFFNET, ONNET et INTERNATIONAL. Elle représente les données de trafic téléphonique par abonné. Chaque ligne correspond à un msisdn (identifiant unique du client) et enregistre le nombre d'appels ou la durée de communication effectués répartis en trois catégories : offnet (vers d'autres opérateurs), onnet (au sein du même opérateur) et international (vers l'étranger). Les colonnes year, month et day indiquent la période exacte de l'enregistrement. Elle permet d'analyser l'évolution du trafic vers l'opérateur Orange, les concurrents, l'étranger, de suivre le comportement des utilisateurs, etc.",
    "monthly_clients": "C'est une table mensuelle qui sert à récupèrer tout les informations sur le client dans le mois. Elle contient des informations détaillées sur les clients. La colonne MSISDN qui représente l’identifiant unique du client tandis que FORMULE indique le type d’offre souscrite (Jamono Allo, Kirene avec Orange, etc). FAMILLE_PROD précise la catégorie du produit (PREPAID, POSTPAID, etc.) et ETAT_LIGNE renseigne l’état actuel de la ligne du client (ACTIVE, RESILIEE, etc.). Les colonnes date_premiere_activation et date_resiliation suivent respectivement la date d’activation initiale et la date de résiliation si elle existe. formule_dmgp, region_90j, departement_90j, commune_arrondissement_90j, ca_cr_commune_90j, region_monthly, departement_monthly, commune_arrondissement_monthly, ca_cr_commune_monthly fournissent des informations commerciales et géographiques des clients au cours des 90 et 30 derniers jours. De meme que zone_drv_90j, zone_dvri_90j, nom_cellule_90j, zone_drv_monthly, zone_dvri_monthly et nom_cellule_monthly donnent des détails sur la zone réseau et la cellule utilisée pour les 90 et 30 derniers jours. statut_predit correspond à une prédiction de statut client (par exemple risque de churn) tandis que age et sex décrivent le profil démographique de l’utilisateur. SEGMENT_RECHARGE et SEGMENT_MARCHE classifient le client selon son comportement de consommation et son marché. last_imei identifie le dernier appareil utilisé, smartphone précise s’il s’agit d’un smartphone et compatible_network indique la technologie réseau supportée (2G, 3G, 4G, 5G). more_used_imei peut référencer l’appareil le plus utilisé. Des indicateurs liés à l’usage sont également présents tels que le parc client (0/1), la régularité, le nombre de réactivations ou de sorties (acquisition, gratuité, usage, nouuveaux arrivés). Enfin, year, month, et day permettent d’historiser et de suivre l’évolution des données dans le temps. La table est mise à jour chaque mois. Elle est important pour l’analyse du comportement client, la gestion du parc, la segmentation marketing, etc.",
    "monthly_data": "C'est une table mensuelle qui donne la consommation data mobile des clients. Elle donne le volume du trafic des clients par réseau 2G, 3G, 4G, 5G. Elle contient des informations sur le trafic data mobile des abonnés. Chaque client est identifié par un msisdn et qui représente l’identifiant unique de l’abonné. Les colonnes trafic_2g_mo, trafic_3g_mo, trafic_4g_mo et trafic_5g_mo indiquent respectivement le volume de données consommées (en Mo) sur chaque type de réseau mobile (2G, 3G, 4G et 5G). La colonne total_volume_mo représente la somme totale de voulume de données (volume de data) consommées par le clients tandis que nb_j_distinct représente le nombre de jours distincts de consommation de données mobile. SEGMENT_RECHARGE et SEGMENT_MARCHE classifient les clients selon leur comportement de consommation (Mass-Market, High, Middle, etc) et leur marché (JEUNES, ENTRANT, KIRENE AVEC ORANGE, etc). formule_dmgp  indique le type d’offre souscrite (Jamono Allo, Kirene avec Orange, AUTRES, etc). ca_cr_commune représente la commune de référence du client. Les colonnes year, month permettent de situer ces consommations dans le temps pour effectuer des analyses périodiques. Elle est utile pour suivre la répartition de l’usage data mobile par technologie réseau et identifier les tendances de consommation.",
    "monthly_international": "C'est une table mensuelle qui donne les communications internationaux ou avec les pass internationaux. Elle contient également les Chiffre d'affaire (CA) des pass internationaux achetés par le client. Chaque ligne correspond à un abonné identifié par son MSISDN et décrit son comportement en termes de consommation et de revenus. Les colonnes ca_pass et CA_PAYG indiquent respectivement le montant ou chiffre d'affaires des forfaits et des usages hors forfait à l'international tandis que duration_mn_payg représente la durée totale de consommation hors forfait en minutes à l'international. La colonne ci_pass_dur renseigne la durée des communications via forfaits à l'international. Les informations géographiques sont disponibles via ca_cr_commune_90j représentant la commune d’activité principale sur les 90 derniers jours. Elle inclut également la segmentation marketing à travers segment_marche et SEGMENT_RECHARGE ainsi que le type de formule souscrite (formule_dmgp). La colonne date_loaded indique la date et l’heure de chargement des données tandis que year et month permettent une analyse temporelle.",
    "monthly_maxit": "C'est une table mensuelle qui regroupe les données d'interactions des clients avec les différents services de l'application Maxit. Autrement dit, elle contient les traces d’usage de l’application MAXIT, une application selfcare utilisée par les abonnés pour gérer leur ligne mobile (consultation de solde, recharges, transferts d'argent, souscription à des offres, etc.). Chaque ligne de la table représente une action ou une tentative d’action effectuée par un utilisateur identifié par son MSISDN avec le nom du service concerné dans la colonne service. Le status indique le résultat de l'opération. La colonne extra_source précise la source ou le canal utilisé tandis que amount représente le montant associé à l’opération et nb_events le nombre d’événements générés. ca_cr_commune identifie la commune où l’opération a été effectuée. Les informations de segmentation marketing sont fournies par SEGMENT_RECHARGE et segment_marche permettant de catégoriser les clients selon leur profil de consommation. formule_dmgp correspond au formule tarifaire souscrite. Enfin year et month situent l’événement dans le temps. Cette table permet le suivi de l’usage des services (fonctionnalités populaires, volume d’utilisation, etc), analyse de performance (succès ou échec des transactions) et de l’activité des clients, etc.",
    "monthly_recharges": "C'est une table mensuelle qui fournit le chiffre d’affaires total ainsi que des différents canaux recharges ( Orange Money, WAVE, cartes , recharges internationales, transferts de crédit Seddo, etc.). Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et détaille les montants de recharge par type : ca_seddo pour les recharges via Seddo, ca_pass_glob_om_jour pour les pass globaux journaliers, ca_credit_om pour les crédits Orange Money, ca_iah pour les recharges internationales, ca_cartes, et ca_wave pour d’autres canaux comme les cartes, Wave. La colonne ca_recharge représente le chiffre d'affaire total (tous les canaux de recharges inclus) tandis que self_top_up indique les recharges effectuées par l’abonné lui-même. Les informations géographiques sont disponibles via ca_cr_commune représentant la commune d’activité principale. Elle inclut également la segmentation marketing à travers segment_marche et SEGMENT_RECHARGE ainsi que le type de formule souscrite (formule_dmgp). year et month permettent une analyse temporelle. Elle permet de quantifier le chiffre d’affaires total, par canaux de recharges (OM, Wave, Seddo, cartes, etc.) , analyser l’impact des offres, etc.",
    "monthly_sargal": "C'est une table mensuelle qui donne les informations sur les échanges et récompenses dans le programme de fidélité Sargal. Elle permet une analyse fine du comportement de fidélité, des préférences cadeaux et du potentiel de conversion client. Elle trace les interactions des abonnés avec le programme de fidélité Sargal en enregistrant les points gagnés, points cumulés et les récompenses obtenues. Chaque ligne correspond à un msisdn (identifiant unique d’un abonné) et renseigne le nombre de points gagné au cours d’une période donnée (points) ainsi que le total des points disponibles ou cumulé (nbpoints). La colonne cadeau_sargal indique le type de cadeau ou récompense associé tandis que cout_cadeau représente le coût de ce cadeau. Les informations géographiques sont disponibles via ca_cr_commune représentant la commune d’activité principale. Elle inclut également la segmentation marketing à travers segment_marche et SEGMENT_RECHARGE ainsi que le type de formule souscrite (formule_dmgp).  year et month permettent une analyse temporelle. Cette table permet de suivre les points gagnés ou échangés dans le cadre du programme Sargal, identifier les profils consommateurs les plus fidèles ou actifs et les cadeaux les plus demandés utilisés, étudier l’impact des formules tarifaires ou segments marketing sur la fidélisation, etc",
    "monthly_sortants": "C'est une table mensuelle qui donne des informations sur la sortie des abonnées. Elle recense les données liées aux sorties de trafic par type et localisation des clients. Chaque ligne représente un abonné identifié par son MSISDN avec les raisons possibles de sa sortie (après acquisition (moins de 3 mois d'anciennete) (usage gratuit (entre 3 et 6 mois d'anciennete), usage payant (après 6 mois d'ancienneté)), et les détails de sa localisation ou rattachement commercial. Les colonnes sortants_acquisition, sortants_gratuite et sortants_usage indiquent respectivement si la communications sortantes est liées à l’acquisition de clients, aux appels gratuits et à l’usage classique. Les données géographiques comprennent REGION, DEPARTEMENT, commune_arrondissement, ca_cr_commune ainsi que zone_DRV et zone_DVRI qui permettent de situer précisément l’activité. La colonne nom_cellule identifie la cellule réseau concernée, utile pour l’analyse technique et la planification. Enfin year et month permettent de replacer les événements dans le temps. Cette table permet de catégoriser les clients sortants  du parc actif Orange.",
    "monthly_souscription": "C'est une table mensuelle qui fournit des informations sur la souscription des catégorie d'offres. Elle contient les informations sur les offres souscrites par les abonnés. Elle comprend l’identifiant unique de l’abonné (msisdn), la catégorie de l'offre (types) comme PASS INTERNET, ILLIMIX, ILLIFLEX, MIXEL, NC, Bundles, etc. Les colonnes sous_mnt, ca_data et ca_voix indiquent respectivement le montant ou chiffre d'affaires des souscriptions (ca_data et ca_voix), la part attribuée à la data (internet) et celle liée à la voix (appels). La colonne sous_cnt précise le nombre de souscriptions enregistrées pour l’offre. SEGMENT_RECHARGE et SEGMENT_MARCHE classifient les clients selon leur comportement de consommation (Mass-Market, High, Middle, etc) et leur marché (JEUNES, ENTRANT, KIRENE AVEC ORANGE, etc). le ca_cr_commune représente la commune de référence du client. year et month permettent de replacer les événements dans le temps. Cette table permet d'Identifier les familles d’offres les plus populaires, les segments recharges et marché dominant, les communes les plus attrayants, etc. exemples de questions : Quelle est le CA BUNDLES de 2025 ? Quelle est le top 10 des communes qui ont généré le plus de CA data pour JAMONO NEW S’COOL ?, etc. Elle permet de suivre les offres les plus rentables par catégorie, identifier les comportements d’achat récurrents ou impulsifs, segmenter les clients par typologie d’offre souscrite (voix-only, data-only, mixte)",
    "monthly_sva": "C'est une table mensuelle qui donne l'ensemble des clients qui ont eu à utiliser les services à valeur ajouté (sva) et les revenus associés. chaque ligne représente un abonné identifié par son MSISDN. Elle contient plusieurs champs clés : detail_service et service décrivent le service utilisé ou la catégorie à laquelle il appartient, tarif indique le coût unitaire du service, segment_marche et SEGMENT_RECHARGE classifient le client selon son profil commercial et son comportement de recharge tandis que formule_dmgp renseigne l’offre tarifaire souscrite. La colonne ca_cr_commune_90j identifie la commune associée au client sur les 90 derniers jours et parc_actif_orange ainsi que parc_actif_sva signalent si l’abonné est actif respectivement sur le réseau Orange ou sur les services à valeur ajoutée. total_sous_mnt représente le montant total souscrit pour le service et ca_recharge le chiffre d’affaires généré par les recharges pour les sva. Enfin, date_loaded indique la date et l’heure de chargement et les colonnes year et month précisent la période d’enregistrement. Cette table permet de suivre les services SVA consommés, le montant dépensé, le statut d’activité, les segments commerciaux, les habitudes de recharge, les caractéristiques géographiques et marketing, etc",
    "monthly_terminaux": "C'est une table mensuelle qui fournit les informations sur les terminaux (smartphone, model, constructeur, etc), trafic (5G et 4G), le comportement des clients et leur localisation. Chaque ligne est identifiée par un MSISDN représentant un abonné unique. La colonne formule_dmgp indique l’offre tarifaire souscrite tandis que segment_marche précise le segment marketing associé au client comme JEUNES, AUTRES, etc. ca_cr_commune_90j désigne la commune liée à l’abonné au cours des 90 derniers jours. La colonne parc indique si le client est actif sur le réseau et last_call_time correspond à la durée depuis le dernier d'appel ou d'activité. device décrit le type d’appareil utilisé tandis que hds_tek_radio et smarphone fournissent des détails techniques sur la connectivité et la compatibilité avec les smartphones. compatible précise la technologie réseau prise en charge (4G, 5G). model et constructeur détaillent le modèle et le fabricant du téléphone utilisé par le client. last_day indique la dernière date d’utilisation enregistrée. Les colonnes trafic_5g_mo, trafic_4g_mo et total_volume_mo mesurent respectivement le volume de trafic en 5G, en 4G et le volume total consommées en mégaoctets (Mo). Enfin, year et month spécifient la période d’enregistrement. Cette table permet d'avoir des informations sur les types et marques d’appareils utilisés par les clients, leurs utilisations de smartphone (0/1), leur volume de trafic (4G, 5G, etc), etc.",
    "monthly_voix": "C'est une table mensuelle qui suit la consommation de voix ou d'appels des abonnés  en distinguant les destinations des appels (opérateurs) la source de la minute consommée (compteur principal, bonus, pass spécifiques). Autrement dit, elle contient  des données du volume ou durée des appels des abonnées sur les différents opérateurs téléphoniques (Orange, Free, Expresso, ProMobile, etc). Chaque ligne correspond à un msisdn (identifiant unique d’un client) et détaille la consommation de voix sur plusieurs opérateurs mobiles avec les colonnes : CSU_Mobile, DIV, Expresso_Mobile, Fixe_Expresso, Fixe_Sonatel, Free, Orange, ProMobile et international. Les colonnes cb_gratuit_dur, cp_gratuit_dur, cy_gratuit_dur, ci_pass_dur, cy_pass_dur, cp_dur et cb_dur représentent différentes durées ou volumes d'appels liés à des offres ou pass qu’ils soient gratuits ou payants suivant les opérateurs téléphonique. SEGMENT_RECHARGE et SEGMENT_MARCHE classifient les clients selon leur comportement de consommation voix (Mass-Market, High, Middle, etc) et leur marché (JEUNES, ENTRANT, KIRENE AVEC ORANGE, etc). le ca_cr_commune représente la commune de référence du client tandisque la formule_dmgp correspond au formule tarifaire souscrite (JAMONO NEW S'COOL, JAMONO ALLO, JAMONO PRO, AUTRES, etc). Enfin, les colonnes year, month et day permettent de situer chaque enregistrement. Elle permet de suivre mensuellement et d’analyser la durée des appels téléphoniques (voix) sur les différents opérateurs.",
    "reporting_5g_daily": "La table représente le reporting des données journalières pour le suivi des performances télécoms, organisées par site ou cellule et segment de marché. Elle  regroupe les sites techniques, une série de KPI quotidiens (Key Performance Indicators) liés à l’usage du réseau 5G ventilés selon le trafic data, le parc actif data/voix (nombre de clients actifs 5G), les segments de marché, la périodicité temporelle (année, mois, jour). Chaque ligne représente un enregistrement journalier pour un site donné et fournit un indicateur réseau classé selon son type (trafic ou parc), sa sous-catégorie (data ou voix) et le segment concerné. Chaque ligne correspond à une mesure spécifique identifiée par le SITE (nom du site réseau) et le MARCHE (segment commercial comme HAUT DE MARCHE, MILIEU DE MARCHE, TRES HAUT DE MARCHE, ENTRANT, JEUNES, AUTRES, KIRENE AVEC ORANGE, BOX, ALL_MARCHE, etc.). La table contient aussi d'autres informations comme KPI_NAME (total_vol, aupu_data_5g, parc_data_actif_5G, parc_data_5G, parc_voix_actif_5G, parc_voix_5G, perc_trafic_data_5g, parc_terminaux_5G, parc_5G_actif, volume_sous, etc), CATEGORIE_KPI (exemple : trafic, parc, volume, etc), SOUS_CAT (ex: trafic_data, parc_data, parc_voix, terminaux, souscription, etc), VALEUR (valeur du trafic ou du parc), UNITE (en MégaOctet (Mo) ou en % pour le trafic data, en client pour le parc data et voix, en nb pour les terminaux), PERIODE, CHANEL, MODE_PAY, year, month, day. La colonne KPI_NAME contient le nom de l’indicateur clé de performance, qui est catégorisé dans la colonne CATEGORIE_KPI (ex. trafic, parc) et affiné dans la colonne  SOUS_CAT. La colonne VALEUR enregistre la valeur observée, exprimée dans une unité précisée dans la colonne UNITE. La périodicité des mesures est définie dans la colonne PERIODE. Les colonnes CHANEL et MODE_PAY décrivent les canaux de distribution et les modes de paiement. La table inclut également des informations temporelles avec les colonnes year, month, et day (au format AAAAMMJJ), permettant d’identifier la date précise de la mesure. Les données sont organisées de manière à suivre l’évolution des indicateurs clés de performance par site, marché et période. L'indicateur du réseau est classé selon le CATEGORIE_KPI (trafic, parc, etc), sa sous-catégorie (data, voix, etc).Voici quelques exemples de questions que la table peut répondre : Quel est le volume total de données 5G consommées en mars 2025 ? Quels sites ont le plus fort trafic data 5G ? Quel est le volume total de données 5G consommées en mars 2025 ?",
    "reporting_ca_data_monthly": "Cette table représente le reporting des Chiffres d'Affaires data (ou internet) mensuelle.Elle décrit, par segment client et par commune, les informations liés à la consommation de données (data),le volume de clients facturés,le chiffre d'affaires (CA) généré par la data ou internet,le montant souscrit aux offres data (sous_mnt),le tout ventilé par formule tarifaire, niveau de recharge, segment marketing, période temporelle et localité.Chaque ligne correspond à une combinaison unique d'une commune, d’un segment client et d’une période et constitue un instantané consolidé des usages data sur une période mensuelle ou journalière.Autrement dit,elle contient des données transactionnelles relatives aux recharges télécoms, enregistrées par commune et segment de marché.Elle comprend la colonne DATE_LOADED (horodatage précis au format YYYY-MM-DD HH:MM:SS.sss indiquant la date et l'heure du chargement des données), segment_marche (segment client, ex. JEUNES, ENTRANT, KIRENE AVEC ORANGE, HAUT DE MARCHE, MILIEU DE MARCHE, etc), SEGMENT_RECHARGE (catégorie de recharge telle que Middle, High, Super High,S0, Mass-Market), formule_dmgp (type de formule ou d’offre commerciale comme JAMONO MAX, KIRENE AVEC ORANGE, etc), ca_cr_commune (commune, ex : TOUBACOUTA, NGAYENE, DAKAR, THIAROYE,etc), parc_data_facturer (nombre de clients ou lignes facturées), volumes (volume de consommation exprimé en gigaoctets), ca_data (chiffre d’affaires lié à la data), sous_mnt (montant total de souscription) ainsi que year et month pour faciliter l’agrégation temporelle des données.Cette structure permet de suivre les performances commerciales et la consommation des services en fonction du marché, des offres et de la commune avec un suivi temporel détaillé.Voici quelques exemples de questions la table peut répondre : Donnez le Top 10 communes par taux de souscription dans le segment ENTRANT? Quel est le chiffre d’affaires data total pour les clients JEUNES en 2025? Quel est le volume moyen consommé par client facturé en data pour JAMONO NEW S'COOL ? Quelle est le montant souscrit moyen des clients pour chaque segment de recharge",
    "reporting_ca_monthly": "Cette table représente le reporting mensuel des chiffres d'affaires (CA) total généré ainsi que des différents canaux de recharges comme OM pour Orange Money, les crédit téléphonique Seddo, les cartes, Wave, etc.Elle permet de suivre, par segment de marché et par commune, les revenus ou chiffres d'affaires générés par différents canaux de recharge ainsi que le montant de souscriptions. Chaque ligne représente une agrégation mensuelle des revenus et souscriptions d’un groupe de clients caractérisé par son segment, sa formule, sa commune et sa période. Elle inclut la colonne DATE_LOADED (horodatage des enregistrements au format YYYY-MM-DD HH:MM:SS.sss), segment_marche (type de marché ciblé comme JEUNES, ENTRANT, AUTRES, etc), SEGMENT_RECHARGE (catégorie de recharge : Middle, High, Mass-Market, Super High, S0), formule_dmgp (offre ou formule commerciale comme JAMONO MAX, JAMONO NEW S'COOL,TRES JEUNES,JAMONO ALLO,etc), et ca_cr_commune (localité ou commune de rattachement).Elle regroupe également plusieurs indicateurs financiers : ca_recharges (chiffres d'affaires total généré par les recharges), ca_cartes (chiffre d’affaires généré par les cartes prépayées), ca_credit_om (chiffre d’affaires lié au crédit via Orange Money), ca_iah (chiffre d'affaire généré à l'international), ca_pass_glob_om_jour (chiffre d'affaire généré par les pass globaux via Orange Money), ca_seddo (chiffres d'affaire généré via SEDDO) et ca_wave (chiffre d'affaire généré via WAVE). On retrouve également nb_subs (nombre d’abonnés ou transactions comptabilisées), CA_HT (chiffre d’affaires total hors taxes) ainsi que les colonnes year et month pour l’analyse temporelle. la colonne ca_recharges est un agrégat du chiffres d'affaires qui englobe tous les canaux de distributions (ca_cartes, ca_credit_om, ca_iah, ca_pass_glob_om_jour, ca_seddo et ca_wave). Notez que les colonnes commençant par 'ca' dans cette table permet de catégoriser le chiffre d'affaires suivant les canaux de recharges comme OM, Wave, Seddo, etc. Cette table permet aussi d’analyser les performances commerciales par segment, type d’offre ou formule et commune tout en suivant l’évolution du chiffre d’affaires au fil du temps. Elle permet aussi de déterminer les chiffres d'affaires générés par OM, Wave, Seddo, cartes, hors taxes, etc. exemple de question pour cette table : Donnez la répartition du chiffre d’affaires hors taxes (HT) par segment de recharge? Top 5 des communes ayant généré le plus de revenus via Seddo? Quelle formule a généré le plus de pass journaliers? Quelle est le nombre de souscriptions et CA généré par canal pour le 1er trimestre 2025 ?",
    "reporting_daily_ca_pag_xarre": "Cette table représente le reporting journalière des chiffres d'affaires généré des voix et SMS en mode PAYG (Pay-As-You-Go) pour les formules ou offres commerciales XARRE. Il est structuré autour des axes commerciaux (formules tarifaires XARRE, segments de marché) et temporels (année, mois, jour) permettant d’évaluer la contribution de la base client aux revenus directs non packagés. Elle contient les colonnes formule_xarre (nom de l’offre xarre ou du produit, comme JAMONO NEW S'COOL, JAMONO ALLO, KIRENE AVEC ORANGE,etc), segment_marche (segment ciblé tel que JEUNES, HAUT DE MARCHE, ENTRANT, etc.), ca_payg_voix_sms (chiffre d’affaires généré par les services voix et SMS en mode PAYG), Date_loaded (horodatage précis du chargement des données au format YYYY-MM-DD HH:MM:SS.sss), ainsi que les colonnes temporelles year, month et day qui facilitent l’analyse chronologique et l’agrégation des données. Voici quelques exemples de questions pour cette table : Identifiez les formules qui génèrent le plus de revenus PAYG? Identifiez les segments qui sont encore dépendants des usages traditionnels (voix/SMS)?",
    "reporting_daily_data_xarre": "Cette table fait le reporting quotidienne du trafic internet et le parc. Elle contient des données sur le trafic Internet et le parc d’abonnés par technologie réseau (2G, 3G, 4G, 5G), ventilées par formule commerciale XARRE (formule_xarre) et segment de marché (segment_marche). Elle regroupe le volume total de données consommées en Mo (sum_total_volume_mo), le parc global d’abonnés (parc_global), ainsi que le détail du trafic et du nombre d’abonnés pour chaque technologie : trafic_2g_mo et parc_2g pour la 2G, trafic_3g_mo et parc_3g pour la 3G, trafic_4g_mo et parc_4g pour la 4G et enfin trafic_5g_mo et parc_5g pour la 5G. Les colonnes Date_loaded, year, month et day indiquent la date et l’heure de chargement des données ainsi que les détails temporels pour faciliter l’agrégation et l’analyse par période. Elle permet d’analyser la répartition du trafic Internet, la migration des abonnés entre différentes technologies réseau, ainsi que la performance de chaque offre xarre ou segment de marché dans le temps.Elle est destiné aussi à évaluer la pénétration technologique(Pour Juin 2025, comparer la pénétration 5G par rapport à la 4G :Taux de pénétration 5G= (parc 5G/parc global) × 100) ), la performance des offres XARRE et le comportement data global des clients  qui ont souscrit aux offres XARRE.Exemples de question pour la table : Quelle est le top 3 des formules xarre les plus consommatrices de 5G pour les JEUNES? Quelle est le nombre d’utilisateurs actifs en 2G vs 4G sur les formules xarre?",
    "reporting_daily_maxit": "Cette table fait le reporting quotidienne des données issues de l'application mobile Maxit qui est mise en place par la SONATEL pour donner des services à ses clients.Autrement dit, elle contient des données transactionnelles et opérationnelles liées aux services télécoms et financiers, organisées par date et heure de chargement (DATE_LOADED). Chaque enregistrement décrit une fonctionnalité ou action (fonctionnalite) par exemple achats, vérification de solde, paiements, transferts,etc classée dans une catégorie (categorie) telle que Telco pour les services téléphoniques, OM pour Orange Money, Eshop pour le commerce électronique, self Care pour l’autogestion ou encore NEW FONCTIONALITY pour les nouvelles fonctionnalités. Elle associe chaque action à une formule commerciale (formule_dmgp) et à un segment de marché (segment_marche) avec la commune concernée (ca_cr_commune_90j). Les colonnes parc, mnt et total_events détaillent respectivement le nombre d’utilisateurs impliqués, le montant des transactions et le nombre total de répétition du meme événements. Enfin, les champs year, month et day permettent de ventiler les données par période pour faciliter l’analyse temporelle. Voici quelques exemples questions pour la table : Quel est le montant total des paiements SENELEC sur le mois de septembre 2024 ? Quels segments utilisent le plus la fonctionnalité QR_CARD_VALIDITY ? Quel est le taux d’adoption de la fonctionnalité OBA_BALANCE en mai 2025 ? Comparer les événements Eshop entre le segment TRES HAUT DE MARCHE et HAUT DE MARCHE",
    "reporting_daily_offer": "Cette table fait le reporting quotidienne sur les souscriptions aux offres suivant le types de souscription et le type d'offre souscrit. Elle contient des informations sur la souscription des offres télécoms regroupant des détails sur les types d'offres.  La colonnes types catégorise le type d'offre comme PASS INTERNET, ILLIMIX, INTERNATIONAL, FNF, BUNDLES, MIXEL, ILLIFLEX, etc. Chaque enregistrement précise la formule commerciale (formule_dmgp), le segment de marché ciblé (segment_marche) ainsi que la commune concernée (ca_cr_commune_90j) et le nom de l’offre souscrit (offer_name). La colonne PERIODE indique la fréquence ou la période de l’offre (ex. Daily, Monthly, ou en mois écoulés). Les colonnes SUBS, sous_cnt et sous_mnt représentent respectivement le nombre de souscriptions, le volume de souscriptions effectuées et le montant des souscriptions. Enfin, DATE_LOADED, year, month et day permettent de suivre la date de chargement des souscriptions et d’effectuer une analyse temporelle. Cette table est essentielle pour évaluer la performance commerciale des différents offres de souscriptions, suivre la consommation journalier par marché et commune et identifier les tendances dans les souscriptions des offres et revenus. Voici quelques exemples de questions de cette table : Quels sont les revenus générés par les PASS INTERNET en 2024 dans la commune de Dakar ? Donnez le nombre d’abonnés ayant souscrit à ILLIMIX JOUR 500F sur les 3 derniers mois? Listez le top 5 des offres souscrites par les jeunes en janvier 2024 avec leur montant total généré? Determinez les meilleures périodes de souscription ?",
    "reporting_sargal_gift_daily": "Cette table fait le reporting quotidienne des données détaillées sur les cadeaux SARGAL attribués aux clients . Ces cadeaux peuvent être des volumes data, des minutes voix, des SMS ou des combinaisons de ces services. Ils sont associés à des abonnés en fonction de leur profil, de leur région d’activité, de leur type d’offre et de leur historique de recharge.Autrement dit, elle présente des données détaillées sur la gestion quotidienne des cadeaux Sargal.Elle contient des informations temporelles comme l'année (year), le mois (month) et la date complète (day). Chaque ligne décrit un cadeau identifié par son nom (sargal_gift_name) et la formule commerciale associée (formule_dmgp). Les colonnes segment_marche et segment_recharge indiquent respectivement le segment de marché visé et le type de segment de recharge. Les données géographiques incluent la région, le département et la commune des clients. La colonne type renseigne la catégorie générale de l’offre (Telco pour les services téléphoniques, OM pour Orange Money, Eshop pour le commerce électronique, self Care pour l’autogestion, ou encore NEW FONCTIONALITY pour les nouvelles fonctionnalités). Les colonnes cout_cadeau et cost_cdr représentent le coût du cadeau offert et le coût enregistré dans le système de facturation. Enfin, nb_transactions et nb_subs indiquent respectivement le nombre total de transactions effectuées et le nombre de souscripteurs uniques. Quelques exemples de questions :  Donnez la distribution des cadeaux selon les segments ?",
    "reporting_daily_parc": "cette table fait le reporting quotidienne du comportement ou parc (actifs ou inactifs) des abonnées ou clients sur les 90 derniers jours.Autrement dit, elle présente des informations sur la segmentation des marchés et de l’activité des abonnés sur 90 jours.Elle contient plusieurs colonnes clés : segment_marche qui identifie le segment de marché ciblé (ex. JEUNES, AUTRES, ENTRANT, etc), et formule_dmgp qui précise la formule d’abonnement ou d’offre utilisée (ex. JAMONO ALLO, KIRENE AVEC ORANGE,etc), la colonne ca_cr_commune_90j qui indique la commune de référence pour l’analyse. SEG_REG décrit la fréquence d’activité des abonnés dans la commune, comme 2 times per week ou less than 1 time per week,etc, permettant de mesurer l’engagement des clients. NB_DAYS_OFF représente le nombre de jours d’inactivité, tandis que parc_90days donne la taille du parc d’abonnés sur les 90 derniers jours. Les colonnes year, month et day situent ces données dans le temps, facilitant le suivi des tendances mensuelles et saisonnières. elle est essentiel pour analyser, évaluer la fidélité et l’activité des clients.Voici des exemples de questions pour cette table : Identifiez les segments actifs selon leur fréquence d'activité ?",
    "reporting_daily_parc_maxit": "Cette table fait le reporting quotidienne du comportement ou parc clients de l'application mobile MAXIT.Elle présente des informations sur l’activité et la segmentation des clients en fonction de leur comportement de recharge et d’utilisation.Chaque ligne représente une combinaison unique de critères marketing et d’usage pour une période donnée. La colonne SEGMENT_RECHARGE indique la catégorie d’engagement ou de consommation des clients, comme Mass-Market, Middle, Super High, High ou S0, permettant de classifier les utilisateurs selon leur fréquence et volume de recharge. segment_marche précise le segment de marché ciblé (ex. JEUNES, AUTRES, TRES HAUT DE MARCHE, etc) tandis que formule_dmgp identifie la formule d’offre ou d’abonnement utilisée (ex. JAMONO NEW S'COOL, KIRENE AVEC ORANGE, etc). La colonne ca_cr_commune_90j correspond à la commune de référence pour l’analyse géographique. segment_active décrit la période d’activité du client, exprimée en jours (ex. A daily, B 30 jours, C 60 jours, D 90 jours), ce qui permet de suivre la régularité d’utilisation. La colonne parc représente le nombre de clients actifs dans cette configuration. Enfin, les colonnes year, month et day situent les données dans le temps permettant un suivi chronologique.",
    "reporting_daily_trafic_xarre": "Cette table fait le reporting quotidienne des trafics sur les formules XARRE. elle présente des informations détaillées sur les volumes de trafic sortant et les parcs d’utilisateurs par type de réseau et d’opérateur, ce qui permet d’analyser les comportements de consommation et la répartition du trafic. Elle sert à analyser les comportements d’appel des clients en fonction de la formule XARRE commerciale souscrite, de leur profil marketing, des réseaux de destination (Orange, Free, Expresso, International, etc.) et de la nature du trafic (gratuit, bonus, pass…). Chaque ligne représente une combinaison unique de segment/offre/date avec des volumes exprimés en durée (secondes ou minutes) et en nombre d’abonnés actifs. La colonne formule_xarre identifie la formule d’abonnement (ex. JAMONO ALLO, jamono pro, AUTRES, etc) tandis que segment_marche précise le segment de marché cible (HAUT DE MARCHE, MILIEU DE MARCHE, JEUNES, etc.). Pour chaque type de réseau ou d’opérateur, deux colonnes sont associées : le volume de trafic sortant et le nombre d’abonnés actifs (parc). Par exemple, trafic_sortant_free et parc_global_free concernent l’opérateur Free, trafic_sortant_orange et parc_global_orange pour Orange, ou encore trafic_sortant_international et parc_global_international pour le trafic international. Certaines colonnes portent sur des communications spécifiques comme les communications gratuites (trafic_sortant_cb_gratuit_dur, trafic_sortant_cp_gratuit_dur) ou les communications via pass (trafic_sortant_ci_pass_dur, trafic_sortant_cy_pass_dur). Enfin, les colonnes Date_loaded, year, month et day permettent de situer les données dans le temps et de suivre l’évolution historique. Elle permet aussi d'analyser la consommation par segment et par opérateur et orienter les décisions stratégiques en matière de marketing et de gestion réseau.",
    "reporting_monthly_international": "cette table fait le reporting mensuel des indicateurs et parcs du trafic à l'international. Elle contient des données sur l’utilisation et la consommation de données à l'international par segment de marché et type d’offre. La colonne DATE_LOADED indique la date et l’heure d’intégration des données. segment_marche identifie la catégorie de clients (ex. JEUNES, AUTRES, TRES HAUT DE MARCHE, etc) tandis que SEGMENT_RECHARGE précise le niveau de recharge ou de consommation (High, Mass-Market, Middle, Super High, S0). La colonne ca_cr_commune_90j correspond à la commune de référence (ex. DIENDER GUEDJI, PAOSKOTO, LOUGA, etc). formule_dmgp renseigne sur la formule d’abonnement ou l’offre utilisée comme JAMONO NEW S'COOL, JAMONO MAX, etc. Les colonnes ca_payg et ca_pass présentent respectivement le chiffre d’affaires généré par les usages hors forfait (Pay-As-You-Go) et celui lié aux pass ou forfaits souscrits à l'international. De plus, duration_mn_payg et duration_mn_pass indiquent la durée totale des communications (en minutes) pour ces deux types d’usage à l'international. Les colonnes parc_payg, parc_pass et parc_international représentent le nombre d’abonnés actifs respectivement sur le Pay-As-You-Go, les pass et l’international. Enfin, les colonnes year et month permettent de suivre l’évolution temporelle des données. Elle permet de déterminer le ca pass, la durée des communications à l'international, d'analyser le trafic et la consommation internationale des clients mobiles.",
    "reporting_monthly_maxit": "Cette table fait le reporting mensuel des données issues de l'application mobile Maxit qui est mise en place par la SONATEL pour donner des services digital à ses clients.Autrement dit, elle contient des données transactionnelles et opérationnelles liées aux services télécoms et financiers, organisées par date et heure de chargement (DATE_LOADED). Elle est structuré à l’échelle agrégée par mois, par fonctionnalité, par segment et par commune. La colonne DATE_LOADED indique la date et l’heure de chargement des souscription. segment_marche identifie la catégorie de clients tels que JEUNES, ENTRANT, HAUT DE MARCHE, KIRENE AVEC ORANGE, etc. La colonne formule_dmgp correspond à l’offre ou au produit souscrit, par exemple JAMONO MAX, JAMONO NEW S'COOL, etc. ca_cr_commune renseigne la localisation géographique (commune) des clients fonctionnalite décrit le type d’opération effectuée telle qu’un Achat Crédit, Paiement facture CANAL, Conversion Point Sargal, etc. La colonne categorie précise la famille de service : Telco (télécommunication), OM (Orange Money), Eshop, ou Self Care. Ensuite, mnt_transaction indique le montant total des transactions réalisées, tandis que nb_events représente le nombre d’événements ou opérations enregistrées et nb_subs correspond au nombre unique d’abonnés impliqués. Enfin, year et month permettent un suivi temporel des activités.",
    "reporting_monthly_sva": "Cette table fait le reporting mensuel du suivi des services à valeur ajoutée (SVA). Elle présente des données sur l’utilisation des services à valeur ajoutée (SVA) et des recharges par région et segment de marché. La colonne ca_cr_commune_90j indique la localisation géographique (commune) des abonnés. segment_marche précise la catégorie de clients tels que JEUNES, AUTRES, ENTRANT, HAUT DE MARCHE, etc tandis que SEGMENT_RECHARGE classe les clients selon leur niveau de consommation, par exemple Mass-Market, Middle, High, S0 ou Super High. La colonne formule_dmgp représente l’offre ou le plan tarifaire souscrit tel que JAMONO NEW S'COOL, JAMONO ALLO, etc. detail_service et service donnent des informations sur le service SVA consommé comme DIGITALVIRGO_HYB__Megawin, BIZAO_HYB__Live Football, CRBT subscription, encore Transfert Bonus, etc. La colonne tarif affiche le prix unitaire du service tandis que parc indique le nombre total d’abonnés associés à ce service et parc_actif_orange identifie le nombre d’abonnés Orange actifs. total_sous_mnt correspond au montant total des souscriptions et parc_actif_sva représente le nombre d’abonnés actifs sur les services à valeur ajoutée. ca_recharge indique le chiffre d’affaires généré par les recharges pour les services à valeurs ajoutées. Enfin, DATE_LOADED renseigne la date et l’heure d’intégration des données, et les colonnes year et month permettent un suivi temporel précis.",
    "reporting_monthly_terminaux": "Cette table fait le reporting mensuel de l’utilisation des services mobiles et la possession de smartphones des clients.  Il donne les indcateurs globaux pour identifier les clients équipés de smartphone ou pas, les utilisateurs de data mobiles selon différents segments de marché et localités. La colonne DATE_LOADED indique la date et l’heure de souscription. formule_dmgp représente le plan tarifaire ou l’offre souscrite tel que JAMONO MAX, JAMONO ALLO, JAMONO NEW S'COOL, etc. segment_marche définit la catégorie de clients comme JEUNES, HAUT DE MARCHE, MILIEU DE MARCHE, ENTRANT, AUTRES, etc. ca_cr_commune_90j précise la commune de rattachement par exemple. La colonne smarphone indique la possession d’un smartphone (1 = oui, 0 = non). PERIODE renseigne la période d’analyse avec des valeurs telles que m, m - 1 ou m - 2, représentant respectivement le mois en cours, le mois précédent et deux mois en arrière. Data_status catégorise les utilisateurs en Data_User (utilisateurs actifs de données) et No_Data_User (non-utilisateurs de données). nb_sub indique le nombre total d’abonnés dans chaque catégorie. Enfin year et month permettent un suivi temporel précis.",
    "reporting_monthly_voix": "Cette table fait le reporting mensuel des consommations voix ou appel sortant par opérateur mobile. Elle présente des données détaillées sur le trafic des appels téléphoniques et la répartition des communications par opérateurmobile, segment de marché et localisation. La colonne DATE_LOADED indique la date et l’heure de chargement des appels. segment_marche définit la catégorie de clients comme JEUNES, MILIEU DE MARCHE, KIRENE AVEC ORANGE etc tandis que SEGMENT_RECHARGE précise le profil de consommation tel que Mass-Market, S0, Middle ou Super High. ca_cr_commune correspond à la localité géographique (commune). formule_dmgp représente l’offre ou le plan tarifaire souscrit (ex. JAMONO ALLO, JAMONO MAX, etc). Les colonnes csu_mobile, div, expresso_mobile, fixe_expresso, fixe_sonatel, orange, free, promobile, international, ci_pass_dur, cy_pass_dur, cy_gratuit_dur, cp_dur et cb_dur détaillent les volumes de trafic voix ou appels sortant pour chaque type de réseau exprimés dans le temps (secondes). Les colonnes parc_csu_mobile, parc_div, parc_expresso_mobile, parc_expresso_mobile, parc_fixe_expresso, parc_fixe_sonatel, parc_orange, parc_free, parc_promobile, parc_international indiquent le nombre d’abonnés actifs par type de réseau. La colonne parc regroupe le total global des abonnés toutes catégories ou opérateur confondues. Enfin year et month permettent une analyse temporelle du trafic des appels. Elle permet d'analyser la répartition du trafic téléphonique, mesurer la part de marché des opérateurs, évaluer la performance des offres, de suivre la consommation inter-opérateurs (Orange, Free, Expresso,ProMobile,  etc.), Identifier les flux sortants selon les offres et zones, etc. Voici quelques exemples de question : Quel segment a émis le plus de minutes vers Free au mois de mars 2025 ? Quelle offre génère le plus d’appels vers l’international à Rufisque ? Quels sont les flux voix sortants depuis la commune de KOUNGHEUL par opérateur ?",
    "reporting_offer_monthly": "Cette table fait le reporting mensuel des souscriptions et des consommations des offres. Elle contient des données détaillées sur les souscriptions et la consommation des offres télécom permettant d’analyser la performance commerciale et le comportement des abonnés. La colonne DATE_LOADED indique la date et l'heure de l'enregistrement de la transaction. La colonnes types catégorise le type d'offre comme PASS INTERNET, INTERNATIONAL, ILLIFLEX, ILLIMIX, MIXEL, BUNDLES, etc. offer_name spécifie le nom de l'offre ou forfait souscrit par exemple PASS NUIT 5 GO, PASS JOUR ALLO MONDE A 1000F, ILLIMIX SEMAINE 1500, etc. segment_marche identifie la cible commerciale comme JEUNES, ENTRANT, etc tandis que SEGMENT_RECHARGE précise le profil de consommation (S0, Middle, Mass-Market, High, Super High). formule_dmgp correspond au plan tarifaire associé, tel que JAMONO ALLO, JAMONO PRO, JAMONO NEW S'COOL, etc. ca_cr_commune désigne la localité géographique (commune) où la souscription a eu lieu. sous_mnt représente le montant total ou chiffres d'affaires des souscriptions et sous_cnt indique le nombre de souscriptions effectuées. Les colonnes ca_data et ca_voix reflètent respectivement le chiffre d'affaires généré par les services data et voix. nb_subs correspond au nombre d'abonnés concernés. CA_SOUS_HT représente le chiffre d'affaires hors taxes lié aux souscriptions. Enfin, les colonnes year et month permettent une analyse temporelle des souscriptions et revenus. cette table est cruciales pour suivre la performance des offres, identifier les segments les plus rentables, évaluer la répartition géographique des souscriptions, etc. Voici quelques exemples de questions de cette table : Quels types d’offres génèrent le plus de CA data (data = internet) chez les jeunes ? Combien d’abonnés ont activé des offres ILLIFLEX au mois de mai 2025 ? (types : ILLIFLEX), Quels segments de recharge consomment le plus de voix internationale ? (types : INTERNATIONAL)",
    "reporting_parc_monthly": "Cette table fait le reporting mensuel des parcs des client. Elle donne une vision fine du cycle de vie des abonnés sur une période donnée par offre tarifaire, segment, zone géographique. Elle regroupe des données sur l’évolution des abonnés et leurs mouvements dans le réseau permettant d’analyser la dynamique des parcs clients et la performance commerciale par segment. La colonne DATE_LOADED indique la date et l'heure d'enregistrement des données. formule_dmgp représente le plan tarifaire ou offre souscrite. parc désigne le nombre total d'abonnés actifs à un instant donné. NA correspond aux non actifs dans le parc clients, c’est-à-dire les nouveaux abonnés enregistrés durant la période. Les colonnes reactives, sortants_acquisition, sortants_gratuite et sortants_usage détaillent respectivement les réactivations d’anciens clients, les clients sortants suite à l’acquisition, les sorties dues à des offres gratuites et les sorties liées à l’usage. gross_adds indique le nombre total de nouveaux clients brutes. segment_marche précise la catégorie de clientèle ciblée comme JEUNES, ENTRANT, etc tandis que SEGMENT_RECHARGE reflète le profil de consommation (S0, Mass-Market, etc.). Les colonnes region_90j, departement_90j et ca_cr_commune_90j donnent la localisation géographique des abonnés permettant un suivi régional, départemental et communal. nb_subs représente le nombre total de souscriptions ou abonnés concernés dans la zone indiquée. Enfin year et month permettent de suivre l’évolution temporelle. Cette table est essentielle pour analyser la croissance ou la décroissance du parc, comprendre les flux d’abonnés (entrées et sorties), mesurer la performance des offres par zone géographique, la segmentation Recharge des Clients, etc. Voici quelques exemples de questions : Quelle est la commune ayant acquis le plus de nouveaux clients en juin 2024 ? Quels départements ont le plus fort taux de churn usage ?",
    "reporting_recharge_daily_xarre": "Cette table fait le reporting pour le suivi journalier du chiffre d'affaires généré par les recharges des offres XARRE ainsi que du parc actif pour chaque formule tarifaire XARRE et segment marketing. Elle contient des données agrégées sur les recharges et le parc global d’abonnés, permettant de suivre la performance commerciale et l’évolution du parc client sur différentes périodes. La colonne formule_xarre indique le type d’offre ou de formule tarifaire utilisée comme AUTRES, JAMONO ALLO, KIRENE AVEC ORANGE, etc. segment_marche précise la catégorie de marché ciblée par exemple ENTRANT pour les nouveaux clients, TRES HAUT DE MARCHE pour la clientèle premium, etc. ca_recharge_global représente le chiffre d’affaires total généré par les recharges des formules tarifaire XARRE sur la période considérée tandis que parc_global indique le nombre total d’abonnés actifs associés à cette formule et ce segment. Les colonnes year, month et day permettent un suivi temporel précis des données allant de l’analyse annuelle à une granularité journalière. Cette table permet aussi de mesurer la croissance du parc, identifier les offres les plus performantes, analyser les comportements de recharge des clients.",
    "reporting_sargal_echangeurs_mon": "Cette table fait le reporting de la vision géographique et commerciale des échanges de points sargal. Elle présente des données de suivi des points (points sargal) d’échange par commune permettant d’analyser la performance des différents segments de marché et de recharge. La colonne formule_dmgp indique le type d’offre ou de forfait commercialisé comme JAMONO MAX, JAMONO NEW S'COOL, KIRENE AVEC ORANGE, etc. segment_marche précise la catégorie de marché ciblée par exemple JEUNES, MILIEU DE MARCHE, TRES HAUT DE MARCHE, etc tandis que SEGMENT_RECHARGE reflète le niveau de recharge (S0, Mass-Market, High, Middle, Super High). ca_cr_commune correspond à la commune concernée. nb_subs représente le nombre d’abonnés actifs dans cette commune et total_point_echanges indique le nombre total de points sargal échangé. Enfin, les colonnes year et month permettent un suivi temporel pour observer l’évolution des échanges sargal. Cette table  permet d'évaluer la densité commerciale des échanges sargal (nb_subs / point d’échange).",
    "reporting_sargal_gift_monthly": "Cette table fait le reporting des cadeaux offerts dans le cadre du programme SARGAL. Elle contient des données liées aux offres promotionnelles et récompenses (cadeaux Sargal) attribuées aux abonnés permettant de suivre leur consommation et l’efficacité des programmes de fidélisation. La colonne sargal_gift_name décrit le nom et la nature du cadeau comme des pass internet, des minutes d’appel, etc. formule_dmgp indique le type d’offre principale associée (ex. JAMONO ALLO, KIRENE AVEC ORANGE, etc). segment_marche et SEGMENT_RECHARGE précisent la catégorie d’abonnés ciblée (ex. JEUNES, AUTRES, etc) et leur niveau de recharge (S0, Mass-Market, Middle, High, Super High). Les colonnes region_90j, departement_90j et ca_cr_commune_90j localisent la zone géographique de distribution tandis que type identifie la nature du service (ex : Telco (télécommunication), OM (Orange Money), Eshop, ou Self Care). cout_cadeau et cost_cdr représentent respectivement le coût du cadeau attribué et celui facturé au réseau. nb_transactions suit le nombre total de transactions liées à ces cadeaux, et nb_subs le nombre d’abonnés bénéficiaires. Enfin, year et month permettent une analyse temporelle, facilitant l’évaluation de la performance des campagnes promotionnelles au fil du temps et l’identification des zones ou segments les plus réactifs. Elle permet aussi de calculer Coût par abonné (cout_cadeau / nb_subs), Coût unitaire moyen du cadeau (cout_cadeau / nb_transactions)\nTaux de récurrence (nb_transactions / nb_subs), etc. Voici quelques exemples de questions : Quel est le coût total des cadeaux offerts dans la région de THIES ? Quel est le cadeau le plus distribué en mai 2025 ? Combien de bénéficiaires ont reçu le cadeau '10mn d’appel' en janvier 2025 ?",
    "reporting_sargal_inscrits": "Cette table répertorie les balances SARGAL des clients. La balance SARGAL correspond aux points, crédits, bonus, etc accumulés par un client via le programme de fidélité SARGAL généralement échangeables contre des cadeaux. La table contient des données de suivi du programme de fidélisation Sargal permettant d’analyser l’état et l’évolution des balances de points des abonnés. La colonne DATE_LOADED indique la date de chargement des points tandis que year, month et day facilitent l’analyse temporelle. subscribed_date correspond à la date d’adhésion de l’abonné utile pour mesurer l’ancienneté. segment_marche et SEGMENT_RECHARGE identifient la catégorie du client (ex. JEUNES, KIRENE AVEC ORANGE, ENTRANT, etc) et son niveau de recharge (S0, Middle, Mass-Market, High, Super High). formule_dmgp désigne le type d’offre ou de formule souscrite. Les colonnes region_90j, departement_90j et ca_cr_commune_90j précisent la localisation géographique de l’abonné. SARGAL_BALANCE_BRACKETS classe les abonnés par tranches de points Sargal (ex. 1 Bal 1 AND 100, 3 Bal 500 AND 1000), permettant de cibler les clients selon leur niveau de fidélité. nb_subs représente le nombre d’abonnés dans la catégorie donnée et balance_sargal indique le solde total de points Sargal accumulés utile pour suivre l’engagement des clients et planifier des actions marketing. Elle permet aussi de déterminer la balance moyenne par abonné (balance_sargal / nb_subs), l'ancienneté moyenne (DATE_LOADED - subscribed_date), etc. Voici quelques exemples de questions : Quels clients ont plus de 500 FCFA de solde dans JAMONO MAX ? (formule_dmgp = 'JAMONO MAX' AND SARGAL_BALANCE_BRACKETS IN ('2 Bal 100 AND 500', '3 Bal 500 AND 1000')), Combien d’abonnés jeunes ont entre 100 et 500 FCFA de SARGAL ? (segment_marche = 'JEUNES' AND SARGAL_BALANCE_BRACKETS = '2 Bal 100 AND 500' → SUM(nb_subs))",
    "reporting_souscription_monthly": "Cette table fait le réporting mensuel des souscriptions des offres tarifaires. Elle présente des données de suivi des souscriptions et revenus télécoms permettant d’analyser la performance commerciale par type d’offre et segment client. La colonne DATE_LOADED indique la date de chargement des données, tandis que year et month servent à l’analyse temporelle. La colonne types catégorise le type d'offre comme PASS INTERNET, INTERNATIONAL, ILLIFLEX, ILLIMIX, MIXEL, BUNDLES, etc, segment_marche et SEGMENT_RECHARGE identifient la cible client et son niveau de recharge. formule_dmgp correspond à la formule ou plan tarifaire utilisé (ex. JAMONO ALLO, JAMONO NEW S'COOL, etc). La colonne ca_cr_commune indique la commune associée à la souscription. sous_mnt (ca_data et ca_voix) représente le montant total ou chiffres d'affaires des souscriptions tandis que sous_cnt indique le nombre total de souscriptions effectuées. Les colonnes ca_data et ca_voix donne le chiffre d’affaires des souscriptions pour les services data et voix. nb_subs correspond au nombre d’abonnés impliqués et CA_SOUS_HT reflète le chiffre d’affaires net hors taxes généré. Cette table est crucial pour évaluer la performance commerciale, suivre la répartition des revenus et identifier les segments clients à fort potentiel pour des actions marketing ciblées. Elle permet aussi de déterminer des informations comme le revenu moyen par souscription (sous_mnt / sous_cnt), revenu moyen par client (CA_SOUS_HT / nb_subs), taux de consommation data vs voix (ca_data / ca_voix), taux de taxation ( (sous_mnt - CA_SOUS_HT) / sous_mnt ), etc. Quelques exemples de questions : Quelles sont les offres BUNDLES (type = BUNDLES) qui génèrent le plus de revenus voix chez les jeunes ? Quelle est le top 10 des communes qui ont généré le plus de CA data pour JAMONO NEW S’COOL ? Quels segments génèrent le plus de revenus HT par abonné ? Quelle est le CA BUNDLES de 2025?",
    "reporting_trafic_data_monthly": "Cette table fait le reporting mensuel de la consommation de données mobiles (Go) par technologie réseau (2G, 3G, 4G, 5G) ainsi que les effectifs du parc utilisant chaque réseau. Elle contient des données de consommation et de parc télécom permettant d’analyser l’évolution du trafic et des abonnés selon les segments de marché. La colonne DATE_LOADED indique la date de chargement tandis que year et month servent au suivi temporel. segment_marche et SEGMENT_RECHARGE identifient la catégorie d’abonnés (ex. JEUNES, MILIEU DE MARCHE, TRES HAUT DE MARCHE, etc) et leur niveau de recharge (ex. S0, Middle, High, Mass-Market, Super High). formule_dmgp correspond au plan tarifaire ou offre souscrite (ex. JAMONO MAX, JAMONO NEW S'COOL, etc). ca_cr_commune précise la commune associée. La colonne famille catégorise le type utilisé pour le trafic (OTHER, PROMOBILE, BOX, etc). Les colonnes trafic_5g_go, trafic_4g_go, trafic_3g_go et trafic_2g_go mesurent le volume de trafic data (en Go) consommé selon la technologie réseau (2G, 3G, 4G, 5G) tandis que total_volume_go indique le volume du trafic total de toutes technologies confondues. parc_4g et parc_5g représentent le nombre d’abonnés actifs 4G et 5G tandis que parc_4g_sup_1mo et parc_5g_sup_1mo indiquent ceux ayant consommé plus de 1 Mo. Enfin, parc_data correspond au nombre total d’abonnés utilisant des services data. La table permet de mesurer l’usage de la mobile data par technologie réseau, suivre l’adoption de la 5G et la saturation des autres réseaux,etc. Elle est essentiel pour suivre l’évolution mensuel du trafic, identifier les segments à forte consommation, etc.",
    "reporting_usage_maxit": "Cette table fait le reporting mensuel des utilisations de l'application mobile Maxit par les clients sur les offres data(ou pass internet) et voix. Elle contient le parc et le CA générés par les offres DATA, ILLIMIX, ILLIFLEX, MIXEL, etc sur l'application Maxit. Elle regroupe des données de consommation et de revenus liés aux services de l'application Maxit permettant d’analyser le comportement des abonnés selon les segments de marché et les types d’offres souscrites. La colonne SEGMENT_RECHARGE indique la catégorie de recharge (High, Super High, Middle, Mass-Market, S0) tandis que segment_marche définit le type de clientèle ciblée (ex. JEUNES, MILIEU DE MARCHE). formule_dmgp correspond au plan tarifaire ou offre commerciale (JAMONO NEW S'COOL, JAMONO ALLO, etc) et ca_cr_commune_90j identifie la commune sur une période de 90 jours. Les colonnes BUY_DATA_*, BUY_ILLIFLEX_*, BUY_ILLIMIX_* et BUY_MIXEL_* détaillent respectivement le nombre d’abonnés (_parc) et les revenus ou Chiffres d'affaires (_CA) générés pour chaque type d’offre : DATA (ou pass internet), ILLIFLEX, ILLIMIX et MIXEL avec une distinction entre CA_HTTC (chiffre d’affaires hors taxe et hors commission) et CA (chiffre d’affaires TTC). TOPUP_parc et TOPUP_CA mesurent le nombre d’utilisateurs et les revenus issus des recharges classiques. Enfin, year et month permettent le suivi temporel des indicateurs. Cette table est utile pour évaluer la performance commerciale, identifier les offres les plus rentables sur l'application Maxit par segment, par commune, par formule tarifaire.Autrement dit, elle permet de déterminer le CA data, illimix, illiflex, mixel et topup de l'application Maxit.",
    "reporting_xarre_offer_nrt": "Cette table fait le reporting des souscriptions aux offres XARRE. Elle présente les données de la consommations des offres XARRE avec des informations détaillées sur chaque transaction. Chaque ligne agrège une activité commerciale (achat, souscription, etc) autour d’une offre spécifique selon le segment marketing du client, le canal de souscription, le type d’offre, la date, l’heure, le parc client ayant souscrit aux offres XARRE (parc), le chiffre d'affaires généré (ca) et le volume. La colonne offer_name_dmgp indique le nom commercial de l’offre XARRE (PASS JOUR 1.5GO A 500F, ILLIMIX SCOOL JOUR 300F, etc), formule_xarre correspond au plan tarifaire associé (JAMONO ALLO, JAMONO NEW S'COOL, etc.) et segment_marche précise la catégorie de clientèle (JEUNES, HAUT DE MARCHE, TRES HAUT DE MARCHE, ENTRANT, etc). catalogue et channel_name identifient la catégorie commerciale et le canal de souscription comme USSD, Webservices IPP Subscription, Orange Money, Maxit_Souscription, etc. type regroupe les familles d’offres telles que PASS INTERNET, ILLIMIX, ILLIFLEX, MIXEL, BUNDLES, etc. parc représente le nombre de souscriptions tandis que ca indique le chiffre d’affaires généré et volumne le nombre d’unités consommées. heure renseigne la plage horaire d’utilisation ('20h-21h', '21h-22h', '22h-23h', '23h-00h', etc) et Date_loaded correspond à la date et l’heure de chargement des souscritions. Enfin, year, month et day facilitent le suivi temporel et les analyses historiques. Cette table permet d'analyser les habitudes de consommation (par plage horaire, type d’offre, channel, par formule tarifaire, etc), suivre l’évolution des ventes par offre et par segment, etc"
  }
]